<?php
/** Конфигурационный файл сайта "ЭКО-ЭФФЕКТ". */

// =====================================================================================================================
// Режим отладки.
// =====================================================================================================================
define('IS_DEBUG_MODE', true);

// =====================================================================================================================
// Данные об адресе сайта.
// =====================================================================================================================
/** Абсолютный адрес сайта. */
define('SITE_URL', 'http://eco-effect.loc/');

// =====================================================================================================================
// Параметры MySQL: Эту информацию можно получить у вашего хостинг-провайдера.
// =====================================================================================================================
/** Хост MySQL базы данных. */
define('DB_HOST', 'localhost');

/** Имя MySQL базы данных. */
define('DB_NAME', 'eco_effect');

/** Имя пользователя, у которого есть права работать в MySQL базе данных. */
define('DB_USERNAME', 'mysql');

/** Пароль для доступа к MySQL базе данных */
define('DB_PASSWORD', 'mysql');

// =====================================================================================================================
// Константы для загружаемых фотографий.
// =====================================================================================================================
/** Максимально допустимый размер загружаемой фотографии. */
define('MAX_IMG_SIZE', 8388608);

// =====================================================================================================================
// Данные конкурса.
// =====================================================================================================================
/** Активен ли конкурс в данный момент */
define('COMPETITION_ACTIVE', true);

/** Дата начала проведения конкурса. */
define('COMPETITION_START', '20.02.2017');

/** Ежедневные победители в номинации "Мусору НЕТ" */
define('TRASH_NO_WINNERS', [
    1   => ['uid' => 77335203,  'photo_id'  => 20011],
    2   => ['uid' => 222577551, 'photo_id'  => 20007],
    3   => null,
    4   => null,
    5   => null,
    6   => null,
    7   => null,
    8   => null,
    9   => null,
    10  => null
]);

/** Ежедневные победители в номинации "Мусор ЕСТЬ" */
define('TRASH_YES_WINNERS', [
    1   => ['uid' => 222577551, 'photo_id'  => 20007],
    2   => ['uid' => 77335203,  'photo_id'  => 20011],
    3   => null,
    4   => null,
    5   => null,
    6   => null,
    7   => null,
    8   => null,
    9   => null,
    10  => null
]);

// =====================================================================================================================
// Данные VK API.
// =====================================================================================================================
/** ID приложения. */
define('VK_CLIENT_ID', 5744801);

/** Защищенный ключ. */
define('VK_SECRET', '92odiCNlyw3uMpHSYh45');

/** Сервисный ключ доступа. */
define('VK_SERVICE', '66e753f666e753f666b81a6e7966b0fb57666e766e753f63e4209265d07ed97fbd52477');

/** Случайное константное значение, используемое для обнуления всех счетчиков лайков и виджетов комментариев */
define('VK_WIDGETS_SALT', 'e4ad93ca07acb8d908a3aa41e920ea4f4ef4f26e7f86cf8291c5db289780a5ae');

// =====================================================================================================================
// Конец конфига.
// =====================================================================================================================
if (!defined('ABSPATH'))
    define('ABSPATH', dirname(__FILE__) . '/');